tschissler/SmartHomeTS/ESP32Firmwares/TemperatureDisplay.Firmware/src/main.cpp
// Default libraries
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <ESP32Ping.h>
#include "ESP32Helpers.h"
#include <ArduinoJson.h>
using ArduinoJson::JsonDocument;

// Shared libaries
#include "AzureOTAUpdater.h"
#include "MQTTClientLib.h"
#include "WifiLib.h"

// Project specific libraries
#include "temperature_display.h"
#include "thermostat_data.h"

// WiFi credentials are read from environment variables and used during compile-time (see platformio.ini)
// Set WIFI_PASSWORDS as environment variables on your dev-system following the pattern: WIFI_PASSWORDS="ssid1;password1|ssid2;password2"
WifiLib wifiLib(WIFI_PASSWORDS);
WiFiClient wifiClient;
WiFiUDP ntpUDP;
static int otaInProgress = 0;
static bool otaEnable = OTA_ENABLED != "false";
static bool sendMQTTMessages = true;
static bool mqttSuccess = false;
// Set by the MQTT callback, acted on in loop() - see mqttCallback() for why the publish
// cannot happen where the message arrives.
static bool versionPublishPending = false;
static String baseTopic = "daten";
static String deviceName = "";
const String mqtt_broker = "mosquitto.intern";
const int mqtt_port = 1883;
static String mqtt_OTAtopic = "OTAUpdate/TemperatureDisplay";
// Retained device heartbeat on status/<location>/<deviceType>/<deviceName>, so a consumer
// can tell a silent device from a healthy one. Must match the OTA topic segment.
static const uint32_t HEARTBEAT_INTERVAL_MS = 60000;
static uint32_t lastHeartbeatMs = 0;
static String mqtt_DeviceNameTopic = "config/TemperaturDisplay/{ID}/DeviceName";
static String mqtt_OutsideTempTopic = "cangateway/M3/WPAE/Temperatur/AF1_Aussenfuehler";
static String mqtt_OutsideTempGardenTopic = "daten/temperatur/M1/Aussen";
static String mqtt_ThermostatWohnzimmerTopic = "data/thermostat/M3/shelly/Wohnzimmer";
static String mqtt_ThermostatEsszimmerTopic = "data/thermostat/M3/shelly/Esszimmer";
static String mqtt_ThermostatKuecheTopic = "data/thermostat/M3/shelly/Kueche";
static String mqtt_ThermostatGaestezimmerTopic = "data/thermostat/M3/shelly/Gaestezimmer";
static String mqtt_ThermostatBueroTopic = "data/thermostat/M3/shelly/Buero";
static String mqtt_HeatPumpCurrentPower = "cangateway/M3/WEZ/Leistung/Aktuelle_Leistung_Heizen";

const char* version = FIRMWARE_VERSION;
String chipID = "";
NTPClient timeClient(ntpUDP);
MQTTClientLib* mqttClientLib = nullptr;

// Create display instance
TemperatureDisplay display;

// Callback functions for display events
void onTemperatureChanged(float temperature, Room room) {
  Serial.printf("Temperature changed to %.1f°C in %s\n", 
                temperature, display.roomToString(room));
  // Here you could send the temperature change to a server, MQTT, etc.
}

void onRoomChanged(Room oldRoom, Room newRoom) {
  Serial.printf("Room changed from %s to %s\n", 
                display.roomToString(oldRoom), display.roomToString(newRoom));
  // Here you could load room-specific settings, update server, etc.
}

String extractVersionFromUrl(String url) {
    int lastUnderscoreIndex = url.lastIndexOf('_');
    int lastDotIndex = url.lastIndexOf('.');

    if (lastUnderscoreIndex != -1 && lastDotIndex != -1 && lastDotIndex > lastUnderscoreIndex) {
        return url.substring(lastUnderscoreIndex + 1, lastDotIndex);
    }

    return "";
}

void mqttCallback(String &topic, String &payload) {
    Serial.println("Message arrived on topic: " + topic + ". Message: " + payload);

    if (topic == mqtt_DeviceNameTopic) {
      deviceName = payload;
      Serial.println("Sensor name set to: " + deviceName);
      // Publishing from here is not safe: the callback runs inside a blocking read in the
      // MQTT library, which is not reentrant. A nested QoS 2 publish waits for its own
      // handshake on the same socket, runs into the 10s command timeout and takes the
      // connection down with it - after which the device reconnects, receives the retained
      // config message again and repeats the whole thing forever. loop() publishes instead.
      versionPublishPending = true;
      return;
    } 

    if (topic == mqtt_OutsideTempTopic) {
      float outsideTemp = payload.toFloat();
      display.updateOutsideTemperature(outsideTemp);
      return;
    }

    if (topic == mqtt_OutsideTempGardenTopic) {
      float outsideTemp = payload.toFloat();
      display.updateOutsideGardenTemperature(outsideTemp);
      return;
    }

    if (topic == mqtt_HeatPumpCurrentPower) {
      float currentPower = payload.toFloat();
      display.updateIsHeatPumpActive(currentPower > 0);
      Serial.printf("Heat pump current power: %.2f kW\n", currentPower);
      return;
    }
    
    if (topic == mqtt_ThermostatWohnzimmerTopic) {
      ThermostatData thermostatData;
      if (thermostatData.parseFromJson(payload)) {
          // Pass the full thermostat data object
          display.updateRoomData(thermostatData, Room::Wohnzimmer);
      } else {
          Serial.println("Failed to parse thermostat data for Wohnzimmer");
      }
      return;
    }

    if (topic == mqtt_ThermostatEsszimmerTopic) {
      ThermostatData thermostatData;
      if (thermostatData.parseFromJson(payload)) {
          display.updateRoomData(thermostatData, Room::Esszimmer);
      } else {
          Serial.println("Failed to parse thermostat data for Esszimmer");
      }
      return;
    }

    if (topic == mqtt_ThermostatKuecheTopic) {
      ThermostatData thermostatData;
      if (thermostatData.parseFromJson(payload)) {
          display.updateRoomData(thermostatData, Room::Kueche);
      } else {
          Serial.println("Failed to parse thermostat data for Küche");
      }
      return;
    }

    if (topic == mqtt_ThermostatGaestezimmerTopic) {
      ThermostatData thermostatData;
      if (thermostatData.parseFromJson(payload)) {
          display.updateRoomData(thermostatData, Room::Gaestezimmer);
      } else {
          Serial.println("Failed to parse thermostat data for Gaestezimmer");
      }
      return;
    }

    if (topic == mqtt_ThermostatBueroTopic) {
      ThermostatData thermostatData;
      if (thermostatData.parseFromJson(payload)) {
          display.updateRoomData(thermostatData, Room::Buero);
      } else {
          Serial.println("Failed to parse thermostat data for Buero");
      }
      return;
    }

    if (topic == mqtt_OTAtopic) {
      if (otaInProgress || !otaEnable) {
        if (otaInProgress)
          Serial.println("OTA in progress, ignoring message");
        if (!otaEnable)
          Serial.println("OTA disabled, ignoring message");
        return;
      }

      String updateVersion = extractVersionFromUrl(payload);
      Serial.println("Current firmware version is " + String(version));
      Serial.println("New firmware version is " + updateVersion);
      if(strcmp(version, updateVersion.c_str())) {
          // Trigger OTA Update
          const char *firmwareUrl = payload.c_str();
          Serial.println("New firmware available, starting OTA Update from " + String(firmwareUrl));
          otaInProgress = true;
          bool result =  AzureOTAUpdater::UpdateFirmwareFromUrl(firmwareUrl);
          if (result) {
            Serial.println("OTA Update successful initiated, waiting to be finished");
          }
      }
      else {
        Serial.println("Firmware is up to date");
      }
    }
    else {
      Serial.println("Unknown topic, ignoring message");
    }
}

void connectToMQTT() {
  if (WiFi.status() != WL_CONNECTED) {
    wifiLib.connect();
  }
  mqttClientLib->connect(false);
  Serial.println("MQTT Client is connected");
}

void targetTemperatureSet(float temperature, Room room) {
  Serial.printf("Target temperature changed to %.1f°C in %s\n", 
                temperature, display.roomToString(room));

  // Publish the new target temperature to MQTT
  String topic = "commands/shelly/M3/" + String(display.roomToString(room));
  mqttClientLib->publish(topic, String(temperature), true, 2);
}

void setup()
{
  Serial.begin(115200);
  Serial.println("------------------  Temperature Display Firmware  ------------------");
  Serial.print("Version: ");
  Serial.println(version);
  Serial.printf("Flash size: %d MB\n", ESP.getFlashChipSize() / (1024 * 1024));
  Serial.printf("PSRAM size: %d MB\n", ESP.getPsramSize() / (1024 * 1024));

  chipID = ESP32Helpers::getChipId();
  Serial.print("ESP32 Chip ID: ");
  Serial.println(chipID);

  // Initialize display
  if (!display.init()) {
    Serial.println("Failed to initialize display");
    return;
  }
  
  if (!display.begin()) {
    Serial.println("Failed to start display");
    return;
  }

  // Setup UI (after display is initialized)
  display.setupUI(600);
  display.updateVersion(version);

  // Connect to WiFi
  Serial.print("Connecting to WiFi ");
  wifiLib.scanAndSelectNetwork();
  wifiLib.connect();
  String ssid = wifiLib.getSSID();

  // Set up MQTT
  String mqttClientID = "ESP32TemperatureDisplayClient_" + chipID;
  mqtt_DeviceNameTopic.replace("{ID}", chipID);
  mqttClientLib = new MQTTClientLib(mqtt_broker, mqtt_port, mqttClientID, wifiClient, mqttCallback);
  connectToMQTT();
  // Only the first connection has to register these; connect() restores every known
  // subscription by itself after a reconnect.
  mqttClientLib->subscribe({
    mqtt_DeviceNameTopic, 
    mqtt_OTAtopic, 
    mqtt_ThermostatBueroTopic, 
    mqtt_ThermostatEsszimmerTopic, 
    mqtt_ThermostatKuecheTopic, 
    mqtt_ThermostatWohnzimmerTopic, 
    mqtt_ThermostatGaestezimmerTopic,
    mqtt_OutsideTempTopic,
    mqtt_OutsideTempGardenTopic,
    mqtt_HeatPumpCurrentPower
  });

  timeClient.begin();
  timeClient.setTimeOffset(0); // Set your time offset from UTC in seconds
  timeClient.update();

  // Set callback functions
  display.setTemperatureChangeCallback(onTemperatureChanged);
  display.setRoomChangeCallback(onRoomChanged);
  display.updateIsConnected(WiFi.status() == WL_CONNECTED);
  display.setTemperatureSetCallback(targetTemperatureSet);

  Serial.println("Initialization complete");
}

void loop()
{
  otaInProgress = AzureOTAUpdater::CheckUpdateStatus();

  if (otaInProgress == 1) {
    display.updateStatusPanel(Status::UPDATE);
  }

  if (otaInProgress < 0) {
    Serial.println("Error during OTA update, stopping process");
  }

  if (otaInProgress != 1) {
    display.lock();
    display.updateTime(timeClient.getEpochTime());
    display.unlock();

    if(!mqttClientLib->loop())
    {
      Serial.println("MQTT Client not connected, reconnecting in loop...");
      connectToMQTT();
    }

    if (versionPublishPending && mqttClientLib->connected()) {
      versionPublishPending = false;
      mqttClientLib->publish(("meta/" + deviceName + "/version/TemperatureDisplay").c_str(), String(version), true, 0);
    }

    if (millis() - lastHeartbeatMs >= HEARTBEAT_INTERVAL_MS) {
      lastHeartbeatMs = millis();
      mqttClientLib->publishStatus("unknown", "TemperatureDisplay", deviceName, String(version));
    }

    display.updateTransferProgress();

    if (display.isDisplayOn && display.isDisplayTimeoutExceeded()) {
      display.turnDisplayOff();
    }
    if (!display.isDisplayOn && !display.isDisplayTimeoutExceeded()) {
      display.turnDisplayOn();
    }
  }
  delay(200);
}

